Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/disk/vm/random-read.txt
random-read: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=16
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

random-read: (groupid=0, jobs=1): err= 0: pid=16479: Tue Sep 22 10:35:51 2026
  read: IOPS=1776, BW=1777MiB/s (1863MB/s)(52.1GiB/30001msec)
    clat (usec): min=214, max=49677, avg=562.01, stdev=1529.07
     lat (usec): min=214, max=49677, avg=562.05, stdev=1529.07
    clat percentiles (usec):
     |  1.00th=[  229],  5.00th=[  233], 10.00th=[  235], 20.00th=[  243],
     | 30.00th=[  265], 40.00th=[  281], 50.00th=[  306], 60.00th=[  359],
     | 70.00th=[  537], 80.00th=[  676], 90.00th=[  750], 95.00th=[  807],
     | 99.00th=[ 2311], 99.50th=[17171], 99.90th=[17171], 99.95th=[17433],
     | 99.99th=[25297]
   bw (  MiB/s): min=  638, max= 3028, per=100.00%, avg=1782.73, stdev=680.01, samples=59
   iops        : min=  638, max= 3028, avg=1782.63, stdev=680.06, samples=59
  lat (usec)   : 250=24.11%, 500=41.73%, 750=24.09%, 1000=8.38%
  lat (msec)   : 2=0.66%, 4=0.16%, 10=0.09%, 20=0.76%, 50=0.02%
  cpu          : usr=0.27%, sys=5.67%, ctx=53310, majf=0, minf=266
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=53308,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1777MiB/s (1863MB/s), 1777MiB/s-1777MiB/s (1863MB/s-1863MB/s), io=52.1GiB (55.9GB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=106478/56, sectors=109033472/576, merge=0/14, ticks=57097/34, in_queue=57131, util=93.95%