Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/disk/vm/random-write.txt
random-write: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=16
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

random-write: (groupid=0, jobs=1): err= 0: pid=16493: Tue Sep 22 10:37:49 2026
  write: IOPS=3740, BW=3740MiB/s (3922MB/s)(110GiB/30001msec); 0 zone resets
    clat (usec): min=165, max=50661, avg=258.85, stdev=289.18
     lat (usec): min=173, max=50697, avg=266.59, stdev=297.47
    clat percentiles (usec):
     |  1.00th=[  196],  5.00th=[  210], 10.00th=[  217], 20.00th=[  219],
     | 30.00th=[  221], 40.00th=[  223], 50.00th=[  227], 60.00th=[  229],
     | 70.00th=[  235], 80.00th=[  243], 90.00th=[  265], 95.00th=[  351],
     | 99.00th=[ 1004], 99.50th=[ 1352], 99.90th=[ 2311], 99.95th=[ 2900],
     | 99.99th=[ 7242]
   bw (  MiB/s): min= 1614, max= 4308, per=99.88%, avg=3735.44, stdev=654.34, samples=59
   iops        : min= 1614, max= 4308, avg=3735.32, stdev=654.30, samples=59
  lat (usec)   : 250=84.96%, 500=11.73%, 750=1.59%, 1000=0.71%
  lat (msec)   : 2=0.83%, 4=0.15%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=4.08%, sys=9.34%, ctx=112215, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,112207,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=3740MiB/s (3922MB/s), 3740MiB/s-3740MiB/s (3922MB/s-3922MB/s), io=110GiB (118GB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=0/223675, sectors=0/228959152, merge=0/19, ticks=0/62028, in_queue=71182, util=83.91%