Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/disk/vm/seq-read.txt
seq-read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=16
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

seq-read: (groupid=0, jobs=1): err= 0: pid=16464: Tue Sep 22 10:33:10 2026
  read: IOPS=2831, BW=2831MiB/s (2969MB/s)(82.9GiB/30001msec)
    clat (usec): min=218, max=92084, avg=352.52, stdev=426.47
     lat (usec): min=218, max=92085, avg=352.56, stdev=426.48
    clat percentiles (usec):
     |  1.00th=[  258],  5.00th=[  265], 10.00th=[  269], 20.00th=[  273],
     | 30.00th=[  277], 40.00th=[  281], 50.00th=[  285], 60.00th=[  289],
     | 70.00th=[  326], 80.00th=[  437], 90.00th=[  482], 95.00th=[  603],
     | 99.00th=[  906], 99.50th=[  971], 99.90th=[ 2073], 99.95th=[ 2835],
     | 99.99th=[13829]
   bw (  MiB/s): min= 1702, max= 2996, per=100.00%, avg=2832.85, stdev=246.82, samples=59
   iops        : min= 1702, max= 2996, avg=2832.80, stdev=246.82, samples=59
  lat (usec)   : 250=0.43%, 500=91.15%, 750=5.56%, 1000=2.42%
  lat (msec)   : 2=0.34%, 4=0.07%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.56%, sys=9.24%, ctx=84941, majf=0, minf=268
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=84940,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=2831MiB/s (2969MB/s), 2831MiB/s-2831MiB/s (2969MB/s-2969MB/s), io=82.9GiB (89.1GB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=169324/4, sectors=173387776/72, merge=0/5, ticks=55141/3, in_queue=55144, util=90.37%