Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/disk/vm/seq-write.txt
seq-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=16
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

seq-write: (groupid=0, jobs=1): err= 0: pid=16449: Tue Sep 22 10:29:30 2026
  write: IOPS=3061, BW=3061MiB/s (3210MB/s)(89.7GiB/30002msec); 0 zone resets
    clat (usec): min=173, max=117565, avg=317.67, stdev=807.84
     lat (usec): min=181, max=117574, avg=325.99, stdev=813.79
    clat percentiles (usec):
     |  1.00th=[  202],  5.00th=[  212], 10.00th=[  217], 20.00th=[  221],
     | 30.00th=[  223], 40.00th=[  227], 50.00th=[  231], 60.00th=[  237],
     | 70.00th=[  245], 80.00th=[  262], 90.00th=[  371], 95.00th=[  693],
     | 99.00th=[ 1844], 99.50th=[ 2409], 99.90th=[ 5604], 99.95th=[ 8717],
     | 99.99th=[29492]
   bw (  MiB/s): min=  471, max= 4302, per=99.96%, avg=3060.03, stdev=868.46, samples=59
   iops        : min=  471, max= 4302, avg=3059.86, stdev=868.51, samples=59
  lat (usec)   : 250=74.61%, 500=17.89%, 750=2.92%, 1000=1.84%
  lat (msec)   : 2=1.88%, 4=0.68%, 10=0.13%, 20=0.03%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=3.76%, sys=7.76%, ctx=91852, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,91843,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=3061MiB/s (3210MB/s), 3061MiB/s-3061MiB/s (3210MB/s-3210MB/s), io=89.7GiB (96.3GB), run=30002-30002msec

Disk stats (read/write):
  vda: ios=0/183257, sectors=0/187644064, merge=0/9, ticks=0/66507, in_queue=79332, util=86.55%